src/cfe/ИнтеграцияСRabbitMQ/Catalogs/RMQ_ТочкиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>RMQ_ТочкиОбмена</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипТочкиОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.RMQ_ТипыТочекОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_ВиртуальныеХосты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/ИнтеграцияСRabbitMQ/InformationRegisters/RMQ_НастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>RMQ_НастройкиМаршрутизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_ТочкиОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_Очереди</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/ИнтеграцияСRabbitMQ/Catalogs/RMQ_ТочкиОбмена/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Действует Тогда
		 ПроверяемыеРеквизиты.Добавить("ТипТочкиОбмена");
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ Действует Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	1 КАК Поле1
			|ИЗ
			|	РегистрСведений.RMQ_НастройкиМаршрутизации КАК RMQ_НастройкиМаршрутизации
			|ГДЕ
			|	RMQ_НастройкиМаршрутизации.ТочкаОбмена = &ТочкаОбмена
			|	И RMQ_НастройкиМаршрутизации.Действует";
		
		Запрос.УстановитьПараметр("ТочкаОбмена", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			Сообщить(НСтр("ru = 'Точка обмена используется в действующих настройках маршрутизации! Отключить признак ""Действует"" нельзя!'"));
			Возврат;
		КонецЕсли;  
	КонецЕсли;
	
	НастройкиПодключения = RMQ_ОбменСообщениями.ПолучитьНастройкиПодключенияRabbitMQ(ВиртуальныйХост);
	
	КлиентКомпоненты = RMQ_ОбменСообщениями.ПолучитьКомпонентуСервер();
	
	Попытка
		КлиентКомпоненты.Connect(
			НастройкиПодключения.Адрес,
			НастройкиПодключения.Порт,
			НастройкиПодключения.ИмяПользователя,
			НастройкиПодключения.Пароль,
			НастройкиПодключения.ВиртуальныйХост);
			
		ТочкаОбмена = Наименование;
		
		Если Действует Тогда
			КлиентКомпоненты.DeclareExchange(ТочкаОбмена, НРег(Строка(ТипТочкиОбмена)), Ложь, Истина, Ложь);
			Сообщить("Точка обмена успешно создана!");
		Иначе
			КлиентКомпоненты.DeleteExchange(ТочкаОбмена, Ложь);
			Сообщить("Точка обмена успешно удалена!");
		КонецЕсли;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка создания точки обмена!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если Действует Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Точка обмена действует! Перед удалением отключите признак ""Действует"" у точки обмена.'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
